src/main/resources/atscale-4/0005-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="58EC67E6-8668-4A29-BA07-491F8C4E2B18"/></soap:Header><soap:Body><Discover xmlns="urn:schemas-microsoft-com:xml-analysis"><RequestType>DISCOVER_PROPERTIES</RequestType><Restrictions><RestrictionList><PropertyName><Value>ServerName</Value><Value>ProviderVersion</Value><Value>MdpropMdxDdlExtensions</Value><Value>MdpropMdxSubqueries</Value><Value>MdpropMdxDrillFunctions</Value><Value>MdpropMdxNamedSets</Value></PropertyName></RestrictionList></Restrictions><Properties><PropertyList><Catalog>ASAdventureMicro</Catalog><SafetyOptions>2</SafetyOptions><MdxMissingMemberMode>Error</MdxMissingMemberMode><DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse><DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID><DbpropMsmdRequestID>05C11DF5-4132-4A46-A473-3B4AEF4B762E</DbpropMsmdRequestID><LocaleIdentifier>1033</LocaleIdentifier><DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility><DbpropMsmdSubqueries>2</DbpropMsmdSubqueries></PropertyList></Properties></Discover></soap:Body></soap:Envelope>